#include <iostream>

// Оголосити три одновимірних масиви.
// Перші два заповнити випадковими значеннями від 1 до 40. В елементи третього масиву записати
// суму відповідних елементів перших двох масивів. (в нульову комірку третього масиву записати
// суму нульових комірок першого і другого масивів і так далі).Потім знайти середнє арифметичне
// елементів третього масиву.
int arr1[];
int arr2[];
int arr_summ[];

int main() {
	srand(time(NULL));
	int index_arr = 0;
	int random_num = rand() % 39 + 1;
	for (index_arr = 0; index_arr < 10; index_arr++) {
		arr1[index_arr] = { random_num };
	};
	std::cout << arr1[index_arr] << std::endl;
	
	
	return 0;
}