#include <iostream>
#include <time.h>
// Оголосити три одновимірних масиви.
// Перші два заповнити випадковими значеннями від 1 до 40.
// В елементи третього масиву записати
// суму відповідних елементів перших двох масивів. (в нульову комірку третього масиву записати
// суму нульових комірок першого і другого масивів і так далі).Потім знайти середнє арифметичне
// елементів третього масиву.

int main() 
{
	//Функція з значенням для створення псевдовипадкових чисел
	srand(time(NULL));
	//Встановлення константи для розміру масивів.
	const int SIZE_OF_ARR = 10;
	//Створення масивів.
	int arr1[SIZE_OF_ARR];
	int arr2[SIZE_OF_ARR];
	int arr3[SIZE_OF_ARR];
	//Створення змінної для суми елементів масивів.
	float sum_of_arr = 0;
	//Цикл для наповнення масивів випадковими числами та сумою елементів за індексом.
	for (int index_arr = 0; index_arr < SIZE_OF_ARR; index_arr++) 
	{
		arr1[index_arr] = rand() % 40 + 1;		
		arr2[index_arr] = rand() % 40 + 1;
		arr3[index_arr] = arr1[index_arr] + arr2[index_arr];
	//Додавання суми масивів до змінної.
		sum_of_arr += arr3[index_arr];
	};
	//Розрахунок середнього арифметичного суми третього масиву.
	sum_of_arr /= SIZE_OF_ARR;
	//Виведення на екран середнього арифметичного.
	std::cout << "Average of array = " << sum_of_arr << std::endl;

	return 0;
}