#include <iostream>
												//Варіант #2
							//Знайти суму цілих додатніх парних чисел менших 50.
int main() {
	// Створення змынних
	int a = 0;
	int summ = 0;
	// Якщо а менша за 50 то
	while (a < 50) {
		a++; // а додати 1

		// якщо а парне то
		if (a % 2 == 0) {
			summ += a;		// до summ додати а
		}
		else {
			continue;		// продовжити цикл
		}
	}
	
	// По закінченні програми вивести повідомлення з сумою парних чисел.
	std::cout << "Сума цілих додатніх парних чисел менших 50 дорівнює " << summ << std::endl;
		return 0;
}